susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32U59x.h
#define FMC_A0_PF0_ PF0,GPIO_AF12
#define _FMC_A0_PF0_ 1

#define FMC_A1_PF1_ PF1,GPIO_AF12
#define _FMC_A1_PF1_ 1

#define FMC_A10_PG0_ PG0,GPIO_AF12
#define _FMC_A10_PG0_ 1

#define FMC_A11_PG1_ PG1,GPIO_AF12
#define _FMC_A11_PG1_ 1

#define FMC_A12_PG2_ PG2,GPIO_AF12
#define _FMC_A12_PG2_ 1

#define FMC_A13_PG3_ PG3,GPIO_AF12
#define _FMC_A13_PG3_ 1

#define FMC_A14_PG4_ PG4,GPIO_AF12
#define _FMC_A14_PG4_ 1

#define FMC_A15_PG5_ PG5,GPIO_AF12
#define _FMC_A15_PG5_ 1

#define FMC_A16_PD11_ PD11,GPIO_AF12
#define _FMC_A16_PD11_ 1

#define FMC_A17_PD12_ PD12,GPIO_AF12
#define _FMC_A17_PD12_ 1

#define FMC_A18_PD13_ PD13,GPIO_AF12
#define _FMC_A18_PD13_ 1

#define FMC_A19_PE3_ PE3,GPIO_AF12
#define _FMC_A19_PE3_ 1

#define FMC_A2_PF2_ PF2,GPIO_AF12
#define _FMC_A2_PF2_ 1

#define FMC_A20_PE4_ PE4,GPIO_AF12
#define _FMC_A20_PE4_ 1

#define FMC_A21_PE5_ PE5,GPIO_AF12
#define _FMC_A21_PE5_ 1

#define FMC_A22_PE6_ PE6,GPIO_AF12
#define _FMC_A22_PE6_ 1

#define FMC_A23_PE2_ PE2,GPIO_AF12
#define _FMC_A23_PE2_ 1

#define FMC_A24_PG13_ PG13,GPIO_AF12
#define _FMC_A24_PG13_ 1

#define FMC_A25_PG14_ PG14,GPIO_AF12
#define _FMC_A25_PG14_ 1

#define FMC_A3_PF3_ PF3,GPIO_AF12
#define _FMC_A3_PF3_ 1

#define FMC_A4_PF4_ PF4,GPIO_AF12
#define _FMC_A4_PF4_ 1

#define FMC_A5_PF5_ PF5,GPIO_AF12
#define _FMC_A5_PF5_ 1

#define FMC_A6_PF12_ PF12,GPIO_AF12
#define _FMC_A6_PF12_ 1

#define FMC_A7_PF13_ PF13,GPIO_AF12
#define _FMC_A7_PF13_ 1

#define FMC_A8_PF14_ PF14,GPIO_AF12
#define _FMC_A8_PF14_ 1

#define FMC_A9_PF15_ PF15,GPIO_AF12
#define _FMC_A9_PF15_ 1

#define FMC_CLK_PD3_ PD3,GPIO_AF12
#define _FMC_CLK_PD3_ 1

#define FMC_D0_PD14_ PD14,GPIO_AF12
#define _FMC_D0_PD14_ 1

#define FMC_D1_PD15_ PD15,GPIO_AF12
#define _FMC_D1_PD15_ 1

#define FMC_D10_PE13_ PE13,GPIO_AF12
#define _FMC_D10_PE13_ 1

#define FMC_D11_PE14_ PE14,GPIO_AF12
#define _FMC_D11_PE14_ 1

#define FMC_D12_PE15_ PE15,GPIO_AF12
#define _FMC_D12_PE15_ 1

#define FMC_D13_PD8_ PD8,GPIO_AF12
#define _FMC_D13_PD8_ 1

#define FMC_D14_PD9_ PD9,GPIO_AF12
#define _FMC_D14_PD9_ 1

#define FMC_D15_PD10_ PD10,GPIO_AF12
#define _FMC_D15_PD10_ 1

#define FMC_D2_PD0_ PD0,GPIO_AF12
#define _FMC_D2_PD0_ 1

#define FMC_D3_PD1_ PD1,GPIO_AF12
#define _FMC_D3_PD1_ 1

#define FMC_D4_PE7_ PE7,GPIO_AF12
#define _FMC_D4_PE7_ 1

#define FMC_D5_PE8_ PE8,GPIO_AF12
#define _FMC_D5_PE8_ 1

#define FMC_D6_PE9_ PE9,GPIO_AF12
#define _FMC_D6_PE9_ 1

#define FMC_D7_PE10_ PE10,GPIO_AF12
#define _FMC_D7_PE10_ 1

#define FMC_D8_PE11_ PE11,GPIO_AF12
#define _FMC_D8_PE11_ 1

#define FMC_D9_PE12_ PE12,GPIO_AF12
#define _FMC_D9_PE12_ 1

#define FMC_DA0_PD14_ PD14,GPIO_AF12
#define _FMC_DA0_PD14_ 1

#define FMC_DA1_PD15_ PD15,GPIO_AF12
#define _FMC_DA1_PD15_ 1

#define FMC_DA10_PE13_ PE13,GPIO_AF12
#define _FMC_DA10_PE13_ 1

#define FMC_DA11_PE14_ PE14,GPIO_AF12
#define _FMC_DA11_PE14_ 1

#define FMC_DA12_PE15_ PE15,GPIO_AF12
#define _FMC_DA12_PE15_ 1

#define FMC_DA13_PD8_ PD8,GPIO_AF12
#define _FMC_DA13_PD8_ 1

#define FMC_DA14_PD9_ PD9,GPIO_AF12
#define _FMC_DA14_PD9_ 1

#define FMC_DA15_PD10_ PD10,GPIO_AF12
#define _FMC_DA15_PD10_ 1

#define FMC_DA2_PD0_ PD0,GPIO_AF12
#define _FMC_DA2_PD0_ 1

#define FMC_DA3_PD1_ PD1,GPIO_AF12
#define _FMC_DA3_PD1_ 1

#define FMC_DA4_PE7_ PE7,GPIO_AF12
#define _FMC_DA4_PE7_ 1

#define FMC_DA5_PE8_ PE8,GPIO_AF12
#define _FMC_DA5_PE8_ 1

#define FMC_DA6_PE9_ PE9,GPIO_AF12
#define _FMC_DA6_PE9_ 1

#define FMC_DA7_PE10_ PE10,GPIO_AF12
#define _FMC_DA7_PE10_ 1

#define FMC_DA8_PE11_ PE11,GPIO_AF12
#define _FMC_DA8_PE11_ 1

#define FMC_DA9_PE12_ PE12,GPIO_AF12
#define _FMC_DA9_PE12_ 1

#define FMC_INT_PG7_ PG7,GPIO_AF12
#define _FMC_INT_PG7_ 1

#define FMC_NBL0_PE0_ PE0,GPIO_AF12
#define _FMC_NBL0_PE0_ 1

#define FMC_NBL1_PB15_ PB15,GPIO_AF11
#define FMC_NBL1_PE1_ PE1,GPIO_AF12
#define _FMC_NBL1_PB15_ 1
#define _FMC_NBL1_PE1_ 1

#define FMC_NCE_PD7_ PD7,GPIO_AF12
#define FMC_NCE_PG9_ PG9,GPIO_AF12
#define _FMC_NCE_PD7_ 1
#define _FMC_NCE_PG9_ 1

#define FMC_NE1_PD7_ PD7,GPIO_AF12
#define _FMC_NE1_PD7_ 1

#define FMC_NE2_PG9_ PG9,GPIO_AF12
#define _FMC_NE2_PG9_ 1

#define FMC_NE3_PG10_ PG10,GPIO_AF12
#define _FMC_NE3_PG10_ 1

#define FMC_NE4_PG12_ PG12,GPIO_AF12
#define _FMC_NE4_PG12_ 1

#define FMC_NL_PB7_ PB7,GPIO_AF12
#define _FMC_NL_PB7_ 1

#define FMC_NOE_PD4_ PD4,GPIO_AF12
#define _FMC_NOE_PD4_ 1

#define FMC_NWAIT_PD6_ PD6,GPIO_AF12
#define _FMC_NWAIT_PD6_ 1

#define FMC_NWE_PD5_ PD5,GPIO_AF12
#define _FMC_NWE_PD5_ 1

#define HSPI1_CLK_PI3_ PI3,GPIO_AF8
#define _HSPI1_CLK_PI3_ 1

#define HSPI1_DQS0_PI2_ PI2,GPIO_AF8
#define _HSPI1_DQS0_PI2_ 1

#define HSPI1_DQS1_PI8_ PI8,GPIO_AF8
#define _HSPI1_DQS1_PI8_ 1

#define HSPI1_IO0_PH10_ PH10,GPIO_AF8
#define _HSPI1_IO0_PH10_ 1

#define HSPI1_IO1_PH11_ PH11,GPIO_AF8
#define _HSPI1_IO1_PH11_ 1

#define HSPI1_IO10_PI11_ PI11,GPIO_AF8
#define _HSPI1_IO10_PI11_ 1

#define HSPI1_IO11_PI12_ PI12,GPIO_AF8
#define _HSPI1_IO11_PI12_ 1

#define HSPI1_IO12_PI13_ PI13,GPIO_AF8
#define _HSPI1_IO12_PI13_ 1

#define HSPI1_IO13_PI14_ PI14,GPIO_AF8
#define _HSPI1_IO13_PI14_ 1

#define HSPI1_IO14_PI15_ PI15,GPIO_AF8
#define _HSPI1_IO14_PI15_ 1

#define HSPI1_IO15_PJ0_ PJ0,GPIO_AF8
#define _HSPI1_IO15_PJ0_ 1

#define HSPI1_IO2_PH12_ PH12,GPIO_AF8
#define _HSPI1_IO2_PH12_ 1

#define HSPI1_IO3_PH13_ PH13,GPIO_AF8
#define _HSPI1_IO3_PH13_ 1

#define HSPI1_IO4_PH14_ PH14,GPIO_AF8
#define _HSPI1_IO4_PH14_ 1

#define HSPI1_IO5_PH15_ PH15,GPIO_AF8
#define _HSPI1_IO5_PH15_ 1

#define HSPI1_IO6_PI0_ PI0,GPIO_AF8
#define _HSPI1_IO6_PI0_ 1

#define HSPI1_IO7_PI1_ PI1,GPIO_AF8
#define _HSPI1_IO7_PI1_ 1

#define HSPI1_IO8_PI9_ PI9,GPIO_AF8
#define _HSPI1_IO8_PI9_ 1

#define HSPI1_IO9_PI10_ PI10,GPIO_AF8
#define _HSPI1_IO9_PI10_ 1

#define HSPI1_NCLK_PI4_ PI4,GPIO_AF8
#define _HSPI1_NCLK_PI4_ 1

#define HSPI1_NCS_PH9_ PH9,GPIO_AF8
#define _HSPI1_NCS_PH9_ 1

#define I2C1_SCL_PB6_ PB6,GPIO_AF4
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define I2C1_SCL_PG14_ PG14,GPIO_AF4
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1
#define _I2C1_SCL_PG14_ 1

#define I2C1_SDA_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF4
#define I2C1_SDA_PB7_ PB7,GPIO_AF4
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define I2C1_SDA_PG13_ PG13,GPIO_AF4
#define _I2C1_SDA_PB3 (JTDO/TRACESWO)_ 1
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1
#define _I2C1_SDA_PG13_ 1

#define I2C1_SMBA_PA1_ PA1,GPIO_AF4
#define I2C1_SMBA_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF4
#define I2C1_SMBA_PB5_ PB5,GPIO_AF4
#define I2C1_SMBA_PG15_ PG15,GPIO_AF4
#define _I2C1_SMBA_PA1_ 1
#define _I2C1_SMBA_PA14 (JTCK/SWCLK)_ 1
#define _I2C1_SMBA_PB5_ 1
#define _I2C1_SMBA_PG15_ 1

#define I2C2_SCL_PB10_ PB10,GPIO_AF4
#define I2C2_SCL_PB13_ PB13,GPIO_AF4
#define I2C2_SCL_PF1_ PF1,GPIO_AF4
#define I2C2_SCL_PH4_ PH4,GPIO_AF4
#define _I2C2_SCL_PB10_ 1
#define _I2C2_SCL_PB13_ 1
#define _I2C2_SCL_PF1_ 1
#define _I2C2_SCL_PH4_ 1

#define I2C2_SDA_PB11_ PB11,GPIO_AF4
#define I2C2_SDA_PB14_ PB14,GPIO_AF4
#define I2C2_SDA_PF0_ PF0,GPIO_AF4
#define I2C2_SDA_PH5_ PH5,GPIO_AF4
#define _I2C2_SDA_PB11_ 1
#define _I2C2_SDA_PB14_ 1
#define _I2C2_SDA_PF0_ 1
#define _I2C2_SDA_PH5_ 1

#define I2C2_SMBA_PB12_ PB12,GPIO_AF4
#define I2C2_SMBA_PF2_ PF2,GPIO_AF4
#define I2C2_SMBA_PH6_ PH6,GPIO_AF4
#define _I2C2_SMBA_PB12_ 1
#define _I2C2_SMBA_PF2_ 1
#define _I2C2_SMBA_PH6_ 1

#define I2C3_SCL_PA7_ PA7,GPIO_AF4
#define I2C3_SCL_PC0_ PC0,GPIO_AF4
#define I2C3_SCL_PG7_ PG7,GPIO_AF4
#define I2C3_SCL_PH7_ PH7,GPIO_AF4
#define _I2C3_SCL_PA7_ 1
#define _I2C3_SCL_PC0_ 1
#define _I2C3_SCL_PG7_ 1
#define _I2C3_SCL_PH7_ 1

#define I2C3_SDA_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF4
#define I2C3_SDA_PC1_ PC1,GPIO_AF4
#define I2C3_SDA_PG8_ PG8,GPIO_AF4
#define I2C3_SDA_PH8_ PH8,GPIO_AF4
#define _I2C3_SDA_PB4 (NJTRST)_ 1
#define _I2C3_SDA_PC1_ 1
#define _I2C3_SDA_PG8_ 1
#define _I2C3_SDA_PH8_ 1

#define I2C3_SMBA_PB2_ PB2,GPIO_AF4
#define I2C3_SMBA_PG6_ PG6,GPIO_AF4
#define I2C3_SMBA_PH9_ PH9,GPIO_AF4
#define _I2C3_SMBA_PB2_ 1
#define _I2C3_SMBA_PG6_ 1
#define _I2C3_SMBA_PH9_ 1

#define I2C4_SCL_PB10_ PB10,GPIO_AF3
#define I2C4_SCL_PB6_ PB6,GPIO_AF5
#define I2C4_SCL_PD12_ PD12,GPIO_AF4
#define I2C4_SCL_PF14_ PF14,GPIO_AF4
#define _I2C4_SCL_PB10_ 1
#define _I2C4_SCL_PB6_ 1
#define _I2C4_SCL_PD12_ 1
#define _I2C4_SCL_PF14_ 1

#define I2C4_SDA_PB11_ PB11,GPIO_AF3
#define I2C4_SDA_PB7_ PB7,GPIO_AF5
#define I2C4_SDA_PD13_ PD13,GPIO_AF4
#define I2C4_SDA_PF15_ PF15,GPIO_AF4
#define _I2C4_SDA_PB11_ 1
#define _I2C4_SDA_PB7_ 1
#define _I2C4_SDA_PD13_ 1
#define _I2C4_SDA_PF15_ 1

