susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32U59x.h
#define LPUART1_TX_PA2_ PA2,GPIO_AF8
#define LPUART1_TX_PB11_ PB11,GPIO_AF8
#define LPUART1_TX_PC1_ PC1,GPIO_AF8
#define LPUART1_TX_PG7_ PG7,GPIO_AF8
#define _LPUART1_TX_PA2_ 1
#define _LPUART1_TX_PB11_ 1
#define _LPUART1_TX_PC1_ 1
#define _LPUART1_TX_PG7_ 1

#define LTDC_B0_PE4_ PE4,GPIO_AF8
#define LTDC_B0_PF12_ PF12,GPIO_AF8
#define _LTDC_B0_PE4_ 1
#define _LTDC_B0_PF12_ 1

#define LTDC_B1_PB2_ PB2,GPIO_AF8
#define LTDC_B1_PB8_ PB8,GPIO_AF7
#define LTDC_B1_PF13_ PF13,GPIO_AF8
#define _LTDC_B1_PB2_ 1
#define _LTDC_B1_PB8_ 1
#define _LTDC_B1_PF13_ 1

#define LTDC_B2_PD14_ PD14,GPIO_AF8
#define _LTDC_B2_PD14_ 1

#define LTDC_B3_PD15_ PD15,GPIO_AF8
#define _LTDC_B3_PD15_ 1

#define LTDC_B4_PD0_ PD0,GPIO_AF8
#define _LTDC_B4_PD0_ 1

#define LTDC_B5_PD1_ PD1,GPIO_AF8
#define _LTDC_B5_PD1_ 1

#define LTDC_B6_PE7_ PE7,GPIO_AF8
#define _LTDC_B6_PE7_ 1

#define LTDC_B7_PE8_ PE8,GPIO_AF8
#define _LTDC_B7_PE8_ 1

#define LTDC_CLK_PD3_ PD3,GPIO_AF8
#define _LTDC_CLK_PD3_ 1

#define LTDC_DE_PD6_ PD6,GPIO_AF8
#define LTDC_DE_PF11_ PF11,GPIO_AF8
#define _LTDC_DE_PD6_ 1
#define _LTDC_DE_PF11_ 1

#define LTDC_G0_PE5_ PE5,GPIO_AF8
#define LTDC_G0_PF14_ PF14,GPIO_AF8
#define _LTDC_G0_PE5_ 1
#define _LTDC_G0_PF14_ 1

#define LTDC_G1_PE6_ PE6,GPIO_AF8
#define LTDC_G1_PF15_ PF15,GPIO_AF8
#define _LTDC_G1_PE6_ 1
#define _LTDC_G1_PF15_ 1

#define LTDC_G2_PE9_ PE9,GPIO_AF8
#define _LTDC_G2_PE9_ 1

#define LTDC_G3_PE10_ PE10,GPIO_AF8
#define _LTDC_G3_PE10_ 1

#define LTDC_G4_PE11_ PE11,GPIO_AF8
#define _LTDC_G4_PE11_ 1

#define LTDC_G5_PE12_ PE12,GPIO_AF8
#define _LTDC_G5_PE12_ 1

#define LTDC_G6_PE13_ PE13,GPIO_AF8
#define _LTDC_G6_PE13_ 1

#define LTDC_G7_PE14_ PE14,GPIO_AF8
#define _LTDC_G7_PE14_ 1

#define LTDC_HSYNC_PE0_ PE0,GPIO_AF8
#define _LTDC_HSYNC_PE0_ 1

#define LTDC_R0_PC6_ PC6,GPIO_AF7
#define LTDC_R0_PE2_ PE2,GPIO_AF8
#define LTDC_R0_PG13_ PG13,GPIO_AF8
#define _LTDC_R0_PC6_ 1
#define _LTDC_R0_PE2_ 1
#define _LTDC_R0_PG13_ 1

#define LTDC_R1_PC7_ PC7,GPIO_AF7
#define LTDC_R1_PE3_ PE3,GPIO_AF8
#define LTDC_R1_PG14_ PG14,GPIO_AF8
#define LTDC_R1_PG6_ PG6,GPIO_AF7
#define _LTDC_R1_PC7_ 1
#define _LTDC_R1_PE3_ 1
#define _LTDC_R1_PG14_ 1
#define _LTDC_R1_PG6_ 1

#define LTDC_R2_PE15_ PE15,GPIO_AF8
#define _LTDC_R2_PE15_ 1

#define LTDC_R3_PD8_ PD8,GPIO_AF8
#define _LTDC_R3_PD8_ 1

#define LTDC_R4_PD9_ PD9,GPIO_AF8
#define _LTDC_R4_PD9_ 1

#define LTDC_R5_PD10_ PD10,GPIO_AF8
#define _LTDC_R5_PD10_ 1

#define LTDC_R6_PD11_ PD11,GPIO_AF8
#define _LTDC_R6_PD11_ 1

#define LTDC_R7_PD12_ PD12,GPIO_AF8
#define _LTDC_R7_PD12_ 1

#define LTDC_VSYNC_PD13_ PD13,GPIO_AF8
#define LTDC_VSYNC_PE1_ PE1,GPIO_AF8
#define _LTDC_VSYNC_PD13_ 1
#define _LTDC_VSYNC_PE1_ 1

#define MDF1_CCK0_PB8_ PB8,GPIO_AF5
#define MDF1_CCK0_PE9_ PE9,GPIO_AF6
#define MDF1_CCK0_PF3_ PF3,GPIO_AF6
#define MDF1_CCK0_PG7_ PG7,GPIO_AF6
#define _MDF1_CCK0_PB8_ 1
#define _MDF1_CCK0_PE9_ 1
#define _MDF1_CCK0_PF3_ 1
#define _MDF1_CCK0_PG7_ 1

#define MDF1_CCK1_PC2_ PC2,GPIO_AF6
#define MDF1_CCK1_PF10_ PF10,GPIO_AF6
#define _MDF1_CCK1_PC2_ 1
#define _MDF1_CCK1_PF10_ 1

#define MDF1_CKI0_PB2_ PB2,GPIO_AF6
#define MDF1_CKI0_PD4_ PD4,GPIO_AF6
#define MDF1_CKI0_PF5_ PF5,GPIO_AF6
#define _MDF1_CKI0_PB2_ 1
#define _MDF1_CKI0_PD4_ 1
#define _MDF1_CKI0_PF5_ 1

#define MDF1_CKI1_PB13_ PB13,GPIO_AF6
#define MDF1_CKI1_PD7_ PD7,GPIO_AF6
#define _MDF1_CKI1_PB13_ 1
#define _MDF1_CKI1_PD7_ 1

#define MDF1_CKI2_PB15_ PB15,GPIO_AF6
#define MDF1_CKI2_PE8_ PE8,GPIO_AF6
#define _MDF1_CKI2_PB15_ 1
#define _MDF1_CKI2_PE8_ 1

#define MDF1_CKI3_PC6_ PC6,GPIO_AF6
#define MDF1_CKI3_PE5_ PE5,GPIO_AF6
#define _MDF1_CKI3_PC6_ 1
#define _MDF1_CKI3_PE5_ 1

#define MDF1_CKI4_PC1_ PC1,GPIO_AF6
#define MDF1_CKI4_PE11_ PE11,GPIO_AF6
#define _MDF1_CKI4_PC1_ 1
#define _MDF1_CKI4_PE11_ 1

#define MDF1_CKI5_PB7_ PB7,GPIO_AF6
#define MDF1_CKI5_PE13_ PE13,GPIO_AF6
#define _MDF1_CKI5_PB7_ 1
#define _MDF1_CKI5_PE13_ 1

#define MDF1_SDI0_PB1_ PB1,GPIO_AF6
#define MDF1_SDI0_PD3_ PD3,GPIO_AF6
#define MDF1_SDI0_PF4_ PF4,GPIO_AF6
#define _MDF1_SDI0_PB1_ 1
#define _MDF1_SDI0_PD3_ 1
#define _MDF1_SDI0_PF4_ 1

#define MDF1_SDI1_PB12_ PB12,GPIO_AF6
#define MDF1_SDI1_PD6_ PD6,GPIO_AF6
#define _MDF1_SDI1_PB12_ 1
#define _MDF1_SDI1_PD6_ 1

#define MDF1_SDI2_PB14_ PB14,GPIO_AF6
#define MDF1_SDI2_PE7_ PE7,GPIO_AF6
#define _MDF1_SDI2_PB14_ 1
#define _MDF1_SDI2_PE7_ 1

#define MDF1_SDI3_PC7_ PC7,GPIO_AF6
#define MDF1_SDI3_PE4_ PE4,GPIO_AF6
#define _MDF1_SDI3_PC7_ 1
#define _MDF1_SDI3_PE4_ 1

#define MDF1_SDI4_PC0_ PC0,GPIO_AF6
#define MDF1_SDI4_PE10_ PE10,GPIO_AF6
#define _MDF1_SDI4_PC0_ 1
#define _MDF1_SDI4_PE10_ 1

#define MDF1_SDI5_PB6_ PB6,GPIO_AF6
#define MDF1_SDI5_PE12_ PE12,GPIO_AF6
#define _MDF1_SDI5_PB6_ 1
#define _MDF1_SDI5_PE12_ 1

#define OCTOSPIM_P1_CLK_PA3_ PA3,GPIO_AF10
#define OCTOSPIM_P1_CLK_PB10_ PB10,GPIO_AF10
#define OCTOSPIM_P1_CLK_PE10_ PE10,GPIO_AF10
#define OCTOSPIM_P1_CLK_PF10_ PF10,GPIO_AF3
#define _OCTOSPIM_P1_CLK_PA3_ 1
#define _OCTOSPIM_P1_CLK_PB10_ 1
#define _OCTOSPIM_P1_CLK_PE10_ 1
#define _OCTOSPIM_P1_CLK_PF10_ 1

#define OCTOSPIM_P1_DQS_PA1_ PA1,GPIO_AF10
#define OCTOSPIM_P1_DQS_PB2_ PB2,GPIO_AF10
#define OCTOSPIM_P1_DQS_PE3_ PE3,GPIO_AF3
#define OCTOSPIM_P1_DQS_PG6_ PG6,GPIO_AF3
#define _OCTOSPIM_P1_DQS_PA1_ 1
#define _OCTOSPIM_P1_DQS_PB2_ 1
#define _OCTOSPIM_P1_DQS_PE3_ 1
#define _OCTOSPIM_P1_DQS_PG6_ 1

#define OCTOSPIM_P1_IO0_PB1_ PB1,GPIO_AF10
#define OCTOSPIM_P1_IO0_PE12_ PE12,GPIO_AF10
#define OCTOSPIM_P1_IO0_PF8_ PF8,GPIO_AF10
#define _OCTOSPIM_P1_IO0_PB1_ 1
#define _OCTOSPIM_P1_IO0_PE12_ 1
#define _OCTOSPIM_P1_IO0_PF8_ 1

#define OCTOSPIM_P1_IO1_PB0_ PB0,GPIO_AF10
#define OCTOSPIM_P1_IO1_PE13_ PE13,GPIO_AF10
#define OCTOSPIM_P1_IO1_PF9_ PF9,GPIO_AF10
#define _OCTOSPIM_P1_IO1_PB0_ 1
#define _OCTOSPIM_P1_IO1_PE13_ 1
#define _OCTOSPIM_P1_IO1_PF9_ 1

#define OCTOSPIM_P1_IO2_PA7_ PA7,GPIO_AF10
#define OCTOSPIM_P1_IO2_PE14_ PE14,GPIO_AF10
#define OCTOSPIM_P1_IO2_PF7_ PF7,GPIO_AF10
#define _OCTOSPIM_P1_IO2_PA7_ 1
#define _OCTOSPIM_P1_IO2_PE14_ 1
#define _OCTOSPIM_P1_IO2_PF7_ 1

#define OCTOSPIM_P1_IO3_PA6_ PA6,GPIO_AF10
#define OCTOSPIM_P1_IO3_PE15_ PE15,GPIO_AF10
#define OCTOSPIM_P1_IO3_PF6_ PF6,GPIO_AF10
#define _OCTOSPIM_P1_IO3_PA6_ 1
#define _OCTOSPIM_P1_IO3_PE15_ 1
#define _OCTOSPIM_P1_IO3_PF6_ 1

#define OCTOSPIM_P1_IO4_PC1_ PC1,GPIO_AF10
#define OCTOSPIM_P1_IO4_PD4_ PD4,GPIO_AF10
#define OCTOSPIM_P1_IO4_PH2_ PH2,GPIO_AF3
#define _OCTOSPIM_P1_IO4_PC1_ 1
#define _OCTOSPIM_P1_IO4_PD4_ 1
#define _OCTOSPIM_P1_IO4_PH2_ 1

#define OCTOSPIM_P1_IO5_PC2_ PC2,GPIO_AF10
#define OCTOSPIM_P1_IO5_PD5_ PD5,GPIO_AF10
#define OCTOSPIM_P1_IO5_PG11_ PG11,GPIO_AF3
#define OCTOSPIM_P1_IO5_PI0_ PI0,GPIO_AF3
#define _OCTOSPIM_P1_IO5_PC2_ 1
#define _OCTOSPIM_P1_IO5_PD5_ 1
#define _OCTOSPIM_P1_IO5_PG11_ 1
#define _OCTOSPIM_P1_IO5_PI0_ 1

