susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32U59x.h
#define OCTOSPIM_P1_IO6_PC3_ PC3,GPIO_AF10
#define OCTOSPIM_P1_IO6_PD6_ PD6,GPIO_AF10
#define _OCTOSPIM_P1_IO6_PC3_ 1
#define _OCTOSPIM_P1_IO6_PD6_ 1

#define OCTOSPIM_P1_IO7_PC0_ PC0,GPIO_AF3
#define OCTOSPIM_P1_IO7_PC4_ PC4,GPIO_AF10
#define OCTOSPIM_P1_IO7_PD7_ PD7,GPIO_AF10
#define _OCTOSPIM_P1_IO7_PC0_ 1
#define _OCTOSPIM_P1_IO7_PC4_ 1
#define _OCTOSPIM_P1_IO7_PD7_ 1

#define OCTOSPIM_P1_NCLK_PB12_ PB12,GPIO_AF10
#define OCTOSPIM_P1_NCLK_PB5_ PB5,GPIO_AF3
#define OCTOSPIM_P1_NCLK_PE9_ PE9,GPIO_AF10
#define OCTOSPIM_P1_NCLK_PF11_ PF11,GPIO_AF3
#define _OCTOSPIM_P1_NCLK_PB12_ 1
#define _OCTOSPIM_P1_NCLK_PB5_ 1
#define _OCTOSPIM_P1_NCLK_PE9_ 1
#define _OCTOSPIM_P1_NCLK_PF11_ 1

#define OCTOSPIM_P1_NCS_PA2_ PA2,GPIO_AF10
#define OCTOSPIM_P1_NCS_PA4_ PA4,GPIO_AF3
#define OCTOSPIM_P1_NCS_PB11_ PB11,GPIO_AF10
#define OCTOSPIM_P1_NCS_PC11_ PC11,GPIO_AF5
#define OCTOSPIM_P1_NCS_PE11_ PE11,GPIO_AF10
#define _OCTOSPIM_P1_NCS_PA2_ 1
#define _OCTOSPIM_P1_NCS_PA4_ 1
#define _OCTOSPIM_P1_NCS_PB11_ 1
#define _OCTOSPIM_P1_NCS_PC11_ 1
#define _OCTOSPIM_P1_NCS_PE11_ 1

#define OCTOSPIM_P2_CLK_PF4_ PF4,GPIO_AF5
#define OCTOSPIM_P2_CLK_PH6_ PH6,GPIO_AF5
#define OCTOSPIM_P2_CLK_PI6_ PI6,GPIO_AF5
#define _OCTOSPIM_P2_CLK_PF4_ 1
#define _OCTOSPIM_P2_CLK_PH6_ 1
#define _OCTOSPIM_P2_CLK_PI6_ 1

#define OCTOSPIM_P2_DQS_PF12_ PF12,GPIO_AF5
#define OCTOSPIM_P2_DQS_PG15_ PG15,GPIO_AF5
#define OCTOSPIM_P2_DQS_PG7_ PG7,GPIO_AF5
#define OCTOSPIM_P2_DQS_PH4_ PH4,GPIO_AF5
#define _OCTOSPIM_P2_DQS_PF12_ 1
#define _OCTOSPIM_P2_DQS_PG15_ 1
#define _OCTOSPIM_P2_DQS_PG7_ 1
#define _OCTOSPIM_P2_DQS_PH4_ 1

#define OCTOSPIM_P2_IO0_PF0_ PF0,GPIO_AF5
#define OCTOSPIM_P2_IO0_PI3_ PI3,GPIO_AF6
#define _OCTOSPIM_P2_IO0_PF0_ 1
#define _OCTOSPIM_P2_IO0_PI3_ 1

#define OCTOSPIM_P2_IO1_PF1_ PF1,GPIO_AF5
#define OCTOSPIM_P2_IO1_PI2_ PI2,GPIO_AF6
#define _OCTOSPIM_P2_IO1_PF1_ 1
#define _OCTOSPIM_P2_IO1_PI2_ 1

#define OCTOSPIM_P2_IO2_PF2_ PF2,GPIO_AF5
#define OCTOSPIM_P2_IO2_PI1_ PI1,GPIO_AF6
#define _OCTOSPIM_P2_IO2_PF2_ 1
#define _OCTOSPIM_P2_IO2_PI1_ 1

#define OCTOSPIM_P2_IO3_PF3_ PF3,GPIO_AF5
#define OCTOSPIM_P2_IO3_PH8_ PH8,GPIO_AF5
#define _OCTOSPIM_P2_IO3_PF3_ 1
#define _OCTOSPIM_P2_IO3_PH8_ 1

#define OCTOSPIM_P2_IO4_PG0_ PG0,GPIO_AF5
#define OCTOSPIM_P2_IO4_PH9_ PH9,GPIO_AF5
#define _OCTOSPIM_P2_IO4_PG0_ 1
#define _OCTOSPIM_P2_IO4_PH9_ 1

#define OCTOSPIM_P2_IO5_PG1_ PG1,GPIO_AF5
#define OCTOSPIM_P2_IO5_PH10_ PH10,GPIO_AF5
#define _OCTOSPIM_P2_IO5_PG1_ 1
#define _OCTOSPIM_P2_IO5_PH10_ 1

#define OCTOSPIM_P2_IO6_PG9_ PG9,GPIO_AF5
#define OCTOSPIM_P2_IO6_PH11_ PH11,GPIO_AF5
#define OCTOSPIM_P2_IO6_PH15_ PH15,GPIO_AF5
#define _OCTOSPIM_P2_IO6_PG9_ 1
#define _OCTOSPIM_P2_IO6_PH11_ 1
#define _OCTOSPIM_P2_IO6_PH15_ 1

#define OCTOSPIM_P2_IO7_PG10_ PG10,GPIO_AF5
#define OCTOSPIM_P2_IO7_PH12_ PH12,GPIO_AF5
#define _OCTOSPIM_P2_IO7_PG10_ 1
#define _OCTOSPIM_P2_IO7_PH12_ 1

#define OCTOSPIM_P2_NCLK_PF5_ PF5,GPIO_AF5
#define OCTOSPIM_P2_NCLK_PH7_ PH7,GPIO_AF5
#define OCTOSPIM_P2_NCLK_PI7_ PI7,GPIO_AF5
#define _OCTOSPIM_P2_NCLK_PF5_ 1
#define _OCTOSPIM_P2_NCLK_PH7_ 1
#define _OCTOSPIM_P2_NCLK_PI7_ 1

#define OCTOSPIM_P2_NCS_PA0_ PA0,GPIO_AF10
#define OCTOSPIM_P2_NCS_PA12_ PA12,GPIO_AF6
#define OCTOSPIM_P2_NCS_PD3_ PD3,GPIO_AF10
#define OCTOSPIM_P2_NCS_PF6_ PF6,GPIO_AF5
#define OCTOSPIM_P2_NCS_PG12_ PG12,GPIO_AF5
#define OCTOSPIM_P2_NCS_PI5_ PI5,GPIO_AF5
#define _OCTOSPIM_P2_NCS_PA0_ 1
#define _OCTOSPIM_P2_NCS_PA12_ 1
#define _OCTOSPIM_P2_NCS_PD3_ 1
#define _OCTOSPIM_P2_NCS_PF6_ 1
#define _OCTOSPIM_P2_NCS_PG12_ 1
#define _OCTOSPIM_P2_NCS_PI5_ 1

#define PSSI_D0_PA9_ PA9,GPIO_AF5
#define PSSI_D0_PC6_ PC6,GPIO_AF10
#define PSSI_D0_PH9_ PH9,GPIO_AF10
#define _PSSI_D0_PA9_ 1
#define _PSSI_D0_PC6_ 1
#define _PSSI_D0_PH9_ 1

#define PSSI_D1_PA10_ PA10,GPIO_AF5
#define PSSI_D1_PC7_ PC7,GPIO_AF10
#define PSSI_D1_PH10_ PH10,GPIO_AF10
#define _PSSI_D1_PA10_ 1
#define _PSSI_D1_PC7_ 1
#define _PSSI_D1_PH10_ 1

#define PSSI_D10_PB5_ PB5,GPIO_AF10
#define PSSI_D10_PD6_ PD6,GPIO_AF4
#define PSSI_D10_PI3_ PI3,GPIO_AF10
#define _PSSI_D10_PB5_ 1
#define _PSSI_D10_PD6_ 1
#define _PSSI_D10_PI3_ 1

#define PSSI_D11_PD2_ PD2,GPIO_AF10
#define PSSI_D11_PF10_ PF10,GPIO_AF10
#define PSSI_D11_PH15_ PH15,GPIO_AF10
#define _PSSI_D11_PD2_ 1
#define _PSSI_D11_PF10_ 1
#define _PSSI_D11_PH15_ 1

#define PSSI_D12_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF10
#define PSSI_D12_PF11_ PF11,GPIO_AF10
#define PSSI_D12_PF6_ PF6,GPIO_AF4
#define _PSSI_D12_PB4 (NJTRST)_ 1
#define _PSSI_D12_PF11_ 1
#define _PSSI_D12_PF6_ 1

#define PSSI_D13_PG15_ PG15,GPIO_AF10
#define PSSI_D13_PI0_ PI0,GPIO_AF10
#define _PSSI_D13_PG15_ 1
#define _PSSI_D13_PI0_ 1

#define PSSI_D14_PA5_ PA5,GPIO_AF4
#define PSSI_D14_PF8_ PF8,GPIO_AF4
#define PSSI_D14_PH4_ PH4,GPIO_AF10
#define _PSSI_D14_PA5_ 1
#define _PSSI_D14_PF8_ 1
#define _PSSI_D14_PH4_ 1

#define PSSI_D15_PC5_ PC5,GPIO_AF4
#define PSSI_D15_PF10_ PF10,GPIO_AF4
#define PSSI_D15_PF9_ PF9,GPIO_AF4
#define _PSSI_D15_PC5_ 1
#define _PSSI_D15_PF10_ 1
#define _PSSI_D15_PF9_ 1

#define PSSI_D2_PC11_ PC11,GPIO_AF4
#define PSSI_D2_PC8_ PC8,GPIO_AF10
#define PSSI_D2_PE0_ PE0,GPIO_AF10
#define PSSI_D2_PH11_ PH11,GPIO_AF10
#define _PSSI_D2_PC11_ 1
#define _PSSI_D2_PC8_ 1
#define _PSSI_D2_PE0_ 1
#define _PSSI_D2_PH11_ 1

#define PSSI_D3_PC9_ PC9,GPIO_AF4
#define PSSI_D3_PE1_ PE1,GPIO_AF10
#define PSSI_D3_PH12_ PH12,GPIO_AF10
#define _PSSI_D3_PC9_ 1
#define _PSSI_D3_PE1_ 1
#define _PSSI_D3_PH12_ 1

#define PSSI_D4_PC11_ PC11,GPIO_AF10
#define PSSI_D4_PE4_ PE4,GPIO_AF10
#define PSSI_D4_PH14_ PH14,GPIO_AF10
#define _PSSI_D4_PC11_ 1
#define _PSSI_D4_PE4_ 1
#define _PSSI_D4_PH14_ 1

#define PSSI_D5_PB6_ PB6,GPIO_AF10
#define PSSI_D5_PD3_ PD3,GPIO_AF4
#define PSSI_D5_PI4_ PI4,GPIO_AF10
#define _PSSI_D5_PB6_ 1
#define _PSSI_D5_PD3_ 1
#define _PSSI_D5_PI4_ 1

#define PSSI_D6_PB8_ PB8,GPIO_AF10
#define PSSI_D6_PE5_ PE5,GPIO_AF10
#define PSSI_D6_PI6_ PI6,GPIO_AF10
#define _PSSI_D6_PB8_ 1
#define _PSSI_D6_PE5_ 1
#define _PSSI_D6_PI6_ 1

#define PSSI_D7_PB9_ PB9,GPIO_AF10
#define PSSI_D7_PE6_ PE6,GPIO_AF10
#define PSSI_D7_PI7_ PI7,GPIO_AF10
#define _PSSI_D7_PB9_ 1
#define _PSSI_D7_PE6_ 1
#define _PSSI_D7_PI7_ 1

#define PSSI_D8_PC10_ PC10,GPIO_AF10
#define PSSI_D8_PH6_ PH6,GPIO_AF10
#define PSSI_D8_PI1_ PI1,GPIO_AF10
#define _PSSI_D8_PC10_ 1
#define _PSSI_D8_PH6_ 1
#define _PSSI_D8_PI1_ 1

