susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32U59x.h
#define SDMMC1_D0_PC8_ PC8,GPIO_AF12
#define _SDMMC1_D0_PC8_ 1

#define SDMMC1_D0DIR_PC6_ PC6,GPIO_AF8
#define _SDMMC1_D0DIR_PC6_ 1

#define SDMMC1_D1_PC9_ PC9,GPIO_AF12
#define _SDMMC1_D1_PC9_ 1

#define SDMMC1_D123DIR_PC7_ PC7,GPIO_AF8
#define _SDMMC1_D123DIR_PC7_ 1

#define SDMMC1_D2_PC10_ PC10,GPIO_AF12
#define _SDMMC1_D2_PC10_ 1

#define SDMMC1_D3_PC11_ PC11,GPIO_AF12
#define _SDMMC1_D3_PC11_ 1

#define SDMMC1_D4_PB8_ PB8,GPIO_AF12
#define _SDMMC1_D4_PB8_ 1

#define SDMMC1_D5_PB9_ PB9,GPIO_AF12
#define SDMMC1_D5_PC0_ PC0,GPIO_AF12
#define _SDMMC1_D5_PB9_ 1
#define _SDMMC1_D5_PC0_ 1

#define SDMMC1_D6_PC6_ PC6,GPIO_AF12
#define _SDMMC1_D6_PC6_ 1

#define SDMMC1_D7_PC7_ PC7,GPIO_AF12
#define _SDMMC1_D7_PC7_ 1

#define SDMMC2_CK_PC1_ PC1,GPIO_AF12
#define SDMMC2_CK_PD6_ PD6,GPIO_AF11
#define _SDMMC2_CK_PC1_ 1
#define _SDMMC2_CK_PD6_ 1

#define SDMMC2_CMD_PA0_ PA0,GPIO_AF12
#define SDMMC2_CMD_PD7_ PD7,GPIO_AF11
#define _SDMMC2_CMD_PA0_ 1
#define _SDMMC2_CMD_PD7_ 1

#define SDMMC2_D0_PB14_ PB14,GPIO_AF12
#define _SDMMC2_D0_PB14_ 1

#define SDMMC2_D1_PB15_ PB15,GPIO_AF12
#define _SDMMC2_D1_PB15_ 1

#define SDMMC2_D2_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF12
#define _SDMMC2_D2_PB3 (JTDO/TRACESWO)_ 1

#define SDMMC2_D3_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF12
#define _SDMMC2_D3_PB4 (NJTRST)_ 1

#define SDMMC2_D4_PB8_ PB8,GPIO_AF11
#define _SDMMC2_D4_PB8_ 1

#define SDMMC2_D5_PB9_ PB9,GPIO_AF11
#define _SDMMC2_D5_PB9_ 1

#define SDMMC2_D6_PC6_ PC6,GPIO_AF11
#define _SDMMC2_D6_PC6_ 1

#define SDMMC2_D7_PC7_ PC7,GPIO_AF11
#define _SDMMC2_D7_PC7_ 1

#define SPI1_MISO_PA11_ PA11,GPIO_AF5
#define SPI1_MISO_PA6_ PA6,GPIO_AF5
#define SPI1_MISO_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF5
#define SPI1_MISO_PE14_ PE14,GPIO_AF5
#define SPI1_MISO_PG3_ PG3,GPIO_AF5
#define _SPI1_MISO_PA11_ 1
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4 (NJTRST)_ 1
#define _SPI1_MISO_PE14_ 1
#define _SPI1_MISO_PG3_ 1

#define SPI1_MOSI_PA12_ PA12,GPIO_AF5
#define SPI1_MOSI_PA7_ PA7,GPIO_AF5
#define SPI1_MOSI_PB5_ PB5,GPIO_AF5
#define SPI1_MOSI_PE15_ PE15,GPIO_AF5
#define SPI1_MOSI_PG4_ PG4,GPIO_AF5
#define _SPI1_MOSI_PA12_ 1
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1
#define _SPI1_MOSI_PE15_ 1
#define _SPI1_MOSI_PG4_ 1

#define SPI1_NSS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF5
#define SPI1_NSS_PA4_ PA4,GPIO_AF5
#define SPI1_NSS_PB0_ PB0,GPIO_AF5
#define SPI1_NSS_PE12_ PE12,GPIO_AF5
#define SPI1_NSS_PG5_ PG5,GPIO_AF5
#define _SPI1_NSS_PA15 (JTDI)_ 1
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PB0_ 1
#define _SPI1_NSS_PE12_ 1
#define _SPI1_NSS_PG5_ 1

#define SPI1_RDY_PA2_ PA2,GPIO_AF5
#define SPI1_RDY_PA8_ PA8,GPIO_AF5
#define SPI1_RDY_PB2_ PB2,GPIO_AF5
#define SPI1_RDY_PE11_ PE11,GPIO_AF5
#define SPI1_RDY_PG6_ PG6,GPIO_AF5
#define _SPI1_RDY_PA2_ 1
#define _SPI1_RDY_PA8_ 1
#define _SPI1_RDY_PB2_ 1
#define _SPI1_RDY_PE11_ 1
#define _SPI1_RDY_PG6_ 1

#define SPI1_SCK_PA1_ PA1,GPIO_AF5
#define SPI1_SCK_PA5_ PA5,GPIO_AF5
#define SPI1_SCK_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF5
#define SPI1_SCK_PE13_ PE13,GPIO_AF5
#define SPI1_SCK_PG2_ PG2,GPIO_AF5
#define _SPI1_SCK_PA1_ 1
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3 (JTDO/TRACESWO)_ 1
#define _SPI1_SCK_PE13_ 1
#define _SPI1_SCK_PG2_ 1

#define SPI2_MISO_PB14_ PB14,GPIO_AF5
#define SPI2_MISO_PC2_ PC2,GPIO_AF5
#define SPI2_MISO_PD3_ PD3,GPIO_AF5
#define SPI2_MISO_PI2_ PI2,GPIO_AF5
#define _SPI2_MISO_PB14_ 1
#define _SPI2_MISO_PC2_ 1
#define _SPI2_MISO_PD3_ 1
#define _SPI2_MISO_PI2_ 1

#define SPI2_MOSI_PB15_ PB15,GPIO_AF5
#define SPI2_MOSI_PC1_ PC1,GPIO_AF3
#define SPI2_MOSI_PC3_ PC3,GPIO_AF5
#define SPI2_MOSI_PD4_ PD4,GPIO_AF5
#define SPI2_MOSI_PI3_ PI3,GPIO_AF5
#define _SPI2_MOSI_PB15_ 1
#define _SPI2_MOSI_PC1_ 1
#define _SPI2_MOSI_PC3_ 1
#define _SPI2_MOSI_PD4_ 1
#define _SPI2_MOSI_PI3_ 1

#define SPI2_NSS_PB12_ PB12,GPIO_AF5
#define SPI2_NSS_PB9_ PB9,GPIO_AF5
#define SPI2_NSS_PD0_ PD0,GPIO_AF5
#define SPI2_NSS_PI0_ PI0,GPIO_AF5
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PB9_ 1
#define _SPI2_NSS_PD0_ 1
#define _SPI2_NSS_PI0_ 1

#define SPI2_RDY_PB11_ PB11,GPIO_AF5
#define SPI2_RDY_PC0_ PC0,GPIO_AF5
#define SPI2_RDY_PD5_ PD5,GPIO_AF5
#define SPI2_RDY_PI4_ PI4,GPIO_AF5
#define _SPI2_RDY_PB11_ 1
#define _SPI2_RDY_PC0_ 1
#define _SPI2_RDY_PD5_ 1
#define _SPI2_RDY_PI4_ 1

#define SPI2_SCK_PA9_ PA9,GPIO_AF3
#define SPI2_SCK_PB10_ PB10,GPIO_AF5
#define SPI2_SCK_PB13_ PB13,GPIO_AF5
#define SPI2_SCK_PD1_ PD1,GPIO_AF5
#define SPI2_SCK_PD3_ PD3,GPIO_AF3
#define SPI2_SCK_PI1_ PI1,GPIO_AF5
#define _SPI2_SCK_PA9_ 1
#define _SPI2_SCK_PB10_ 1
#define _SPI2_SCK_PB13_ 1
#define _SPI2_SCK_PD1_ 1
#define _SPI2_SCK_PD3_ 1
#define _SPI2_SCK_PI1_ 1

#define SPI3_MISO_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF6
#define SPI3_MISO_PC11_ PC11,GPIO_AF6
#define SPI3_MISO_PG10_ PG10,GPIO_AF6
#define _SPI3_MISO_PB4 (NJTRST)_ 1
#define _SPI3_MISO_PC11_ 1
#define _SPI3_MISO_PG10_ 1

#define SPI3_MOSI_PB5_ PB5,GPIO_AF6
#define SPI3_MOSI_PC12_ PC12,GPIO_AF6
#define SPI3_MOSI_PD6_ PD6,GPIO_AF5
#define SPI3_MOSI_PG11_ PG11,GPIO_AF6
#define _SPI3_MOSI_PB5_ 1
#define _SPI3_MOSI_PC12_ 1
#define _SPI3_MOSI_PD6_ 1
#define _SPI3_MOSI_PG11_ 1

#define SPI3_NSS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF6
#define SPI3_NSS_PA4_ PA4,GPIO_AF6
#define SPI3_NSS_PG12_ PG12,GPIO_AF6
#define _SPI3_NSS_PA15 (JTDI)_ 1
#define _SPI3_NSS_PA4_ 1
#define _SPI3_NSS_PG12_ 1

#define SPI3_RDY_PA0_ PA0,GPIO_AF6
#define SPI3_RDY_PB8_ PB8,GPIO_AF6
#define SPI3_RDY_PG13_ PG13,GPIO_AF6
#define _SPI3_RDY_PA0_ 1
#define _SPI3_RDY_PB8_ 1
#define _SPI3_RDY_PG13_ 1

#define SPI3_SCK_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF6
#define SPI3_SCK_PC10_ PC10,GPIO_AF6
#define SPI3_SCK_PG9_ PG9,GPIO_AF6
#define _SPI3_SCK_PB3 (JTDO/TRACESWO)_ 1
#define _SPI3_SCK_PC10_ 1
#define _SPI3_SCK_PG9_ 1

#define TIM15_BKIN_PA9_ PA9,GPIO_AF14
#define TIM15_BKIN_PB12_ PB12,GPIO_AF14
#define _TIM15_BKIN_PA9_ 1
#define _TIM15_BKIN_PB12_ 1

#define TIM15_CH1_PA2_ PA2,GPIO_AF14
#define TIM15_CH1_PB14_ PB14,GPIO_AF14
#define TIM15_CH1_PF9_ PF9,GPIO_AF14
#define TIM15_CH1_PG10_ PG10,GPIO_AF14
#define _TIM15_CH1_PA2_ 1
#define _TIM15_CH1_PB14_ 1
#define _TIM15_CH1_PF9_ 1
#define _TIM15_CH1_PG10_ 1

#define TIM15_CH1N_PA1_ PA1,GPIO_AF14
#define TIM15_CH1N_PB13_ PB13,GPIO_AF14
#define TIM15_CH1N_PG9_ PG9,GPIO_AF14
#define _TIM15_CH1N_PA1_ 1
#define _TIM15_CH1N_PB13_ 1
#define _TIM15_CH1N_PG9_ 1

