susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32U59x.h
#define UART3_RX_PA5_ PA5,GPIO_AF7
#define UART3_RX_PB11_ PB11,GPIO_AF7
#define UART3_RX_PC11_ PC11,GPIO_AF7
#define UART3_RX_PC5_ PC5,GPIO_AF7
#define UART3_RX_PD9_ PD9,GPIO_AF7
#define _UART3_RX_PA5_ 1
#define _UART3_RX_PB11_ 1
#define _UART3_RX_PC11_ 1
#define _UART3_RX_PC5_ 1
#define _UART3_RX_PD9_ 1

#define UART3_TX_PA7_ PA7,GPIO_AF7
#define UART3_TX_PB10_ PB10,GPIO_AF7
#define UART3_TX_PC10_ PC10,GPIO_AF7
#define UART3_TX_PC4_ PC4,GPIO_AF7
#define UART3_TX_PD8_ PD8,GPIO_AF7
#define _UART3_TX_PA7_ 1
#define _UART3_TX_PB10_ 1
#define _UART3_TX_PC10_ 1
#define _UART3_TX_PC4_ 1
#define _UART3_TX_PD8_ 1

#define UART4_CTS_PB7_ PB7,GPIO_AF8
#define _UART4_CTS_PB7_ 1

#define UART4_DE_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF8
#define _UART4_DE_PA15 (JTDI)_ 1

#define UART4_RTS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF8
#define _UART4_RTS_PA15 (JTDI)_ 1

#define UART4_RX_PA1_ PA1,GPIO_AF8
#define UART4_RX_PC11_ PC11,GPIO_AF8
#define _UART4_RX_PA1_ 1
#define _UART4_RX_PC11_ 1

#define UART4_TX_PA0_ PA0,GPIO_AF8
#define UART4_TX_PC10_ PC10,GPIO_AF8
#define _UART4_TX_PA0_ 1
#define _UART4_TX_PC10_ 1

#define UART5_CTS_PB5_ PB5,GPIO_AF8
#define _UART5_CTS_PB5_ 1

#define UART5_DE_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF8
#define _UART5_DE_PB4 (NJTRST)_ 1

#define UART5_RTS_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF8
#define _UART5_RTS_PB4 (NJTRST)_ 1

#define UART5_RX_PD2_ PD2,GPIO_AF8
#define UART5_RX_PF4_ PF4,GPIO_AF8
#define _UART5_RX_PD2_ 1
#define _UART5_RX_PF4_ 1

#define UART5_TX_PC12_ PC12,GPIO_AF8
#define UART5_TX_PF3_ PF3,GPIO_AF8
#define _UART5_TX_PC12_ 1
#define _UART5_TX_PF3_ 1

#define UART6_CK_PC1_ PC1,GPIO_AF7
#define UART6_CK_PD14_ PD14,GPIO_AF7
#define UART6_CK_PE2_ PE2,GPIO_AF7
#define UART6_CK_PF2_ PF2,GPIO_AF7
#define UART6_CK_PJ6_ PJ6,GPIO_AF7
#define _UART6_CK_PC1_ 1
#define _UART6_CK_PD14_ 1
#define _UART6_CK_PE2_ 1
#define _UART6_CK_PF2_ 1
#define _UART6_CK_PJ6_ 1

#define UART6_CTS_PC0_ PC0,GPIO_AF7
#define UART6_CTS_PD13_ PD13,GPIO_AF7
#define UART6_CTS_PE3_ PE3,GPIO_AF7
#define UART6_CTS_PF3_ PF3,GPIO_AF7
#define UART6_CTS_PJ7_ PJ7,GPIO_AF7
#define _UART6_CTS_PC0_ 1
#define _UART6_CTS_PD13_ 1
#define _UART6_CTS_PE3_ 1
#define _UART6_CTS_PF3_ 1
#define _UART6_CTS_PJ7_ 1

#define UART6_DE_PD15_ PD15,GPIO_AF7
#define UART6_DE_PE4_ PE4,GPIO_AF7
#define UART6_DE_PF4_ PF4,GPIO_AF7
#define UART6_DE_PJ5_ PJ5,GPIO_AF7
#define _UART6_DE_PD15_ 1
#define _UART6_DE_PE4_ 1
#define _UART6_DE_PF4_ 1
#define _UART6_DE_PJ5_ 1

#define UART6_RTS_PD15_ PD15,GPIO_AF7
#define UART6_RTS_PE4_ PE4,GPIO_AF7
#define UART6_RTS_PF4_ PF4,GPIO_AF7
#define UART6_RTS_PJ5_ PJ5,GPIO_AF7
#define _UART6_RTS_PD15_ 1
#define _UART6_RTS_PE4_ 1
#define _UART6_RTS_PF4_ 1
#define _UART6_RTS_PJ5_ 1

#define UART6_RX_PC2_ PC2,GPIO_AF7
#define UART6_RX_PC8_ PC8,GPIO_AF7
#define UART6_RX_PE0_ PE0,GPIO_AF7
#define UART6_RX_PF1_ PF1,GPIO_AF7
#define UART6_RX_PJ4_ PJ4,GPIO_AF7
#define _UART6_RX_PC2_ 1
#define _UART6_RX_PC8_ 1
#define _UART6_RX_PE0_ 1
#define _UART6_RX_PF1_ 1
#define _UART6_RX_PJ4_ 1

#define UART6_TX_PC3_ PC3,GPIO_AF7
#define UART6_TX_PC9_ PC9,GPIO_AF7
#define UART6_TX_PE1_ PE1,GPIO_AF7
#define UART6_TX_PF0_ PF0,GPIO_AF7
#define UART6_TX_PJ3_ PJ3,GPIO_AF7
#define _UART6_TX_PC3_ 1
#define _UART6_TX_PC9_ 1
#define _UART6_TX_PE1_ 1
#define _UART6_TX_PF0_ 1
#define _UART6_TX_PJ3_ 1

#define UART7_CTS_PA6_ PA6,GPIO_AF8
#define UART7_CTS_PB13_ PB13,GPIO_AF8
#define UART7_CTS_PG5_ PG5,GPIO_AF8
#define _UART7_CTS_PA6_ 1
#define _UART7_CTS_PB13_ 1
#define _UART7_CTS_PG5_ 1

#define UART7_DE_PB1_ PB1,GPIO_AF8
#define UART7_DE_PB12_ PB12,GPIO_AF8
#define UART7_DE_PG6_ PG6,GPIO_AF8
#define _UART7_DE_PB1_ 1
#define _UART7_DE_PB12_ 1
#define _UART7_DE_PG6_ 1

#define UART7_RTS_PB1_ PB1,GPIO_AF8
#define UART7_RTS_PB12_ PB12,GPIO_AF8
#define UART7_RTS_PG6_ PG6,GPIO_AF8
#define _UART7_RTS_PB1_ 1
#define _UART7_RTS_PB12_ 1
#define _UART7_RTS_PG6_ 1

#define UART7_RX_PA3_ PA3,GPIO_AF8
#define UART7_RX_PB10_ PB10,GPIO_AF8
#define UART7_RX_PC0_ PC0,GPIO_AF8
#define UART7_RX_PG8_ PG8,GPIO_AF8
#define _UART7_RX_PA3_ 1
#define _UART7_RX_PB10_ 1
#define _UART7_RX_PC0_ 1
#define _UART7_RX_PG8_ 1

#define UART7_TX_PA2_ PA2,GPIO_AF8
#define UART7_TX_PB11_ PB11,GPIO_AF8
#define UART7_TX_PC1_ PC1,GPIO_AF8
#define UART7_TX_PG7_ PG7,GPIO_AF8
#define _UART7_TX_PA2_ 1
#define _UART7_TX_PB11_ 1
#define _UART7_TX_PC1_ 1
#define _UART7_TX_PG7_ 1

#define UCPD1_FRSTX1_PA2_ PA2,GPIO_AF11
#define UCPD1_FRSTX1_PB2_ PB2,GPIO_AF11
#define UCPD1_FRSTX1_PG6_ PG6,GPIO_AF11
#define _UCPD1_FRSTX1_PA2_ 1
#define _UCPD1_FRSTX1_PB2_ 1
#define _UCPD1_FRSTX1_PG6_ 1

#define UCPD1_FRSTX2_PC11_ PC11,GPIO_AF11
#define UCPD1_FRSTX2_PF13_ PF13,GPIO_AF11
#define UCPD1_FRSTX2_PG7_ PG7,GPIO_AF11
#define _UCPD1_FRSTX2_PC11_ 1
#define _UCPD1_FRSTX2_PF13_ 1
#define _UCPD1_FRSTX2_PG7_ 1

#define USART1_CK_PA8_ PA8,GPIO_AF7
#define USART1_CK_PB5_ PB5,GPIO_AF7
#define USART1_CK_PG13_ PG13,GPIO_AF7
#define _USART1_CK_PA8_ 1
#define _USART1_CK_PB5_ 1
#define _USART1_CK_PG13_ 1

#define USART1_CTS_PA11_ PA11,GPIO_AF7
#define USART1_CTS_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF7
#define USART1_CTS_PG11_ PG11,GPIO_AF7
#define _USART1_CTS_PA11_ 1
#define _USART1_CTS_PB4 (NJTRST)_ 1
#define _USART1_CTS_PG11_ 1

#define USART1_DE_PA12_ PA12,GPIO_AF7
#define USART1_DE_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF7
#define USART1_DE_PG12_ PG12,GPIO_AF7
#define _USART1_DE_PA12_ 1
#define _USART1_DE_PB3 (JTDO/TRACESWO)_ 1
#define _USART1_DE_PG12_ 1

#define USART1_RTS_PA12_ PA12,GPIO_AF7
#define USART1_RTS_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF7
#define USART1_RTS_PG12_ PG12,GPIO_AF7
#define _USART1_RTS_PA12_ 1
#define _USART1_RTS_PB3 (JTDO/TRACESWO)_ 1
#define _USART1_RTS_PG12_ 1

#define USART1_RX_PA10_ PA10,GPIO_AF7
#define USART1_RX_PB7_ PB7,GPIO_AF7
#define USART1_RX_PG10_ PG10,GPIO_AF7
#define _USART1_RX_PA10_ 1
#define _USART1_RX_PB7_ 1
#define _USART1_RX_PG10_ 1

#define USART1_TX_PA9_ PA9,GPIO_AF7
#define USART1_TX_PB6_ PB6,GPIO_AF7
#define USART1_TX_PG9_ PG9,GPIO_AF7
#define _USART1_TX_PA9_ 1
#define _USART1_TX_PB6_ 1
#define _USART1_TX_PG9_ 1

#define USART2_CK_PA4_ PA4,GPIO_AF7
#define USART2_CK_PD7_ PD7,GPIO_AF7
#define _USART2_CK_PA4_ 1
#define _USART2_CK_PD7_ 1

#define USART2_CTS_PA0_ PA0,GPIO_AF7
#define USART2_CTS_PD3_ PD3,GPIO_AF7
#define _USART2_CTS_PA0_ 1
#define _USART2_CTS_PD3_ 1

#define USART2_DE_PA1_ PA1,GPIO_AF7
#define USART2_DE_PD4_ PD4,GPIO_AF7
#define _USART2_DE_PA1_ 1
#define _USART2_DE_PD4_ 1

#define USART2_RTS_PA1_ PA1,GPIO_AF7
#define USART2_RTS_PD4_ PD4,GPIO_AF7
#define _USART2_RTS_PA1_ 1
#define _USART2_RTS_PD4_ 1

