susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32U59x.h
#define USART2_RX_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF3
#define USART2_RX_PA3_ PA3,GPIO_AF7
#define USART2_RX_PD6_ PD6,GPIO_AF7
#define _USART2_RX_PA15 (JTDI)_ 1
#define _USART2_RX_PA3_ 1
#define _USART2_RX_PD6_ 1

#define USART2_TX_PA2_ PA2,GPIO_AF7
#define USART2_TX_PD5_ PD5,GPIO_AF7
#define _USART2_TX_PA2_ 1
#define _USART2_TX_PD5_ 1

#define USART3_CK_PB0_ PB0,GPIO_AF7
#define USART3_CK_PB12_ PB12,GPIO_AF7
#define USART3_CK_PC12_ PC12,GPIO_AF7
#define USART3_CK_PD10_ PD10,GPIO_AF7
#define _USART3_CK_PB0_ 1
#define _USART3_CK_PB12_ 1
#define _USART3_CK_PC12_ 1
#define _USART3_CK_PD10_ 1

#define USART3_CTS_PA6_ PA6,GPIO_AF7
#define USART3_CTS_PB13_ PB13,GPIO_AF7
#define USART3_CTS_PD11_ PD11,GPIO_AF7
#define _USART3_CTS_PA6_ 1
#define _USART3_CTS_PB13_ 1
#define _USART3_CTS_PD11_ 1

#define USART3_DE_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF7
#define USART3_DE_PB1_ PB1,GPIO_AF7
#define USART3_DE_PB14_ PB14,GPIO_AF7
#define USART3_DE_PD12_ PD12,GPIO_AF7
#define USART3_DE_PD2_ PD2,GPIO_AF7
#define _USART3_DE_PA15 (JTDI)_ 1
#define _USART3_DE_PB1_ 1
#define _USART3_DE_PB14_ 1
#define _USART3_DE_PD12_ 1
#define _USART3_DE_PD2_ 1

#define USART3_RTS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF7
#define USART3_RTS_PB1_ PB1,GPIO_AF7
#define USART3_RTS_PB14_ PB14,GPIO_AF7
#define USART3_RTS_PD12_ PD12,GPIO_AF7
#define USART3_RTS_PD2_ PD2,GPIO_AF7
#define _USART3_RTS_PA15 (JTDI)_ 1
#define _USART3_RTS_PB1_ 1
#define _USART3_RTS_PB14_ 1
#define _USART3_RTS_PD12_ 1
#define _USART3_RTS_PD2_ 1

#define USART3_RX_PA5_ PA5,GPIO_AF7
#define USART3_RX_PB11_ PB11,GPIO_AF7
#define USART3_RX_PC11_ PC11,GPIO_AF7
#define USART3_RX_PC5_ PC5,GPIO_AF7
#define USART3_RX_PD9_ PD9,GPIO_AF7
#define _USART3_RX_PA5_ 1
#define _USART3_RX_PB11_ 1
#define _USART3_RX_PC11_ 1
#define _USART3_RX_PC5_ 1
#define _USART3_RX_PD9_ 1

#define USART3_TX_PA7_ PA7,GPIO_AF7
#define USART3_TX_PB10_ PB10,GPIO_AF7
#define USART3_TX_PC10_ PC10,GPIO_AF7
#define USART3_TX_PC4_ PC4,GPIO_AF7
#define USART3_TX_PD8_ PD8,GPIO_AF7
#define _USART3_TX_PA7_ 1
#define _USART3_TX_PB10_ 1
#define _USART3_TX_PC10_ 1
#define _USART3_TX_PC4_ 1
#define _USART3_TX_PD8_ 1

#define USART6_CK_PC1_ PC1,GPIO_AF7
#define USART6_CK_PD14_ PD14,GPIO_AF7
#define USART6_CK_PE2_ PE2,GPIO_AF7
#define USART6_CK_PF2_ PF2,GPIO_AF7
#define USART6_CK_PJ6_ PJ6,GPIO_AF7
#define _USART6_CK_PC1_ 1
#define _USART6_CK_PD14_ 1
#define _USART6_CK_PE2_ 1
#define _USART6_CK_PF2_ 1
#define _USART6_CK_PJ6_ 1

#define USART6_CTS_PC0_ PC0,GPIO_AF7
#define USART6_CTS_PD13_ PD13,GPIO_AF7
#define USART6_CTS_PE3_ PE3,GPIO_AF7
#define USART6_CTS_PF3_ PF3,GPIO_AF7
#define USART6_CTS_PJ7_ PJ7,GPIO_AF7
#define _USART6_CTS_PC0_ 1
#define _USART6_CTS_PD13_ 1
#define _USART6_CTS_PE3_ 1
#define _USART6_CTS_PF3_ 1
#define _USART6_CTS_PJ7_ 1

#define USART6_DE_PD15_ PD15,GPIO_AF7
#define USART6_DE_PE4_ PE4,GPIO_AF7
#define USART6_DE_PF4_ PF4,GPIO_AF7
#define USART6_DE_PJ5_ PJ5,GPIO_AF7
#define _USART6_DE_PD15_ 1
#define _USART6_DE_PE4_ 1
#define _USART6_DE_PF4_ 1
#define _USART6_DE_PJ5_ 1

#define USART6_RTS_PD15_ PD15,GPIO_AF7
#define USART6_RTS_PE4_ PE4,GPIO_AF7
#define USART6_RTS_PF4_ PF4,GPIO_AF7
#define USART6_RTS_PJ5_ PJ5,GPIO_AF7
#define _USART6_RTS_PD15_ 1
#define _USART6_RTS_PE4_ 1
#define _USART6_RTS_PF4_ 1
#define _USART6_RTS_PJ5_ 1

#define USART6_RX_PC2_ PC2,GPIO_AF7
#define USART6_RX_PC8_ PC8,GPIO_AF7
#define USART6_RX_PE0_ PE0,GPIO_AF7
#define USART6_RX_PF1_ PF1,GPIO_AF7
#define USART6_RX_PJ4_ PJ4,GPIO_AF7
#define _USART6_RX_PC2_ 1
#define _USART6_RX_PC8_ 1
#define _USART6_RX_PE0_ 1
#define _USART6_RX_PF1_ 1
#define _USART6_RX_PJ4_ 1

#define USART6_TX_PC3_ PC3,GPIO_AF7
#define USART6_TX_PC9_ PC9,GPIO_AF7
#define USART6_TX_PE1_ PE1,GPIO_AF7
#define USART6_TX_PF0_ PF0,GPIO_AF7
#define USART6_TX_PJ3_ PJ3,GPIO_AF7
#define _USART6_TX_PC3_ 1
#define _USART6_TX_PC9_ 1
#define _USART6_TX_PE1_ 1
#define _USART6_TX_PF0_ 1
#define _USART6_TX_PJ3_ 1

#define USB_OTG_HS_ID_PA10_ PA10,GPIO_AF10
#define _USB_OTG_HS_ID_PA10_ 1

#define USB_OTG_HS_SOF_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF10
#define USB_OTG_HS_SOF_PA8_ PA8,GPIO_AF10
#define _USB_OTG_HS_SOF_PA14 (JTCK/SWCLK)_ 1
#define _USB_OTG_HS_SOF_PA8_ 1

#endif /* LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION */